In [1]:
import pandas as pd

In [2]:
cars = pd.Series(["BMW","HONDA","MAHENDRA"])

In [3]:
cars

0         BMW
1       HONDA
2    MAHENDRA
dtype: object

In [4]:
colours = pd.Series(["Red","Green","Blue"])

In [5]:
number = pd.Series(["123","856","789"])

In [6]:
fulldata = pd.DataFrame({"CARS":cars,"Colours":colours,"RG No":number})

In [7]:
fulldata

       CARS Colours RG No
0       BMW     Red   123
1     HONDA   Green   856
2  MAHENDRA    Blue   789

In [8]:
carsSales = pd.read_csv("7.1 car-sales.csv")

In [9]:
carsSales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [10]:
missingData = pd.read_csv("9.2 car-sales-missing-data.csv")

In [11]:
missingData

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

In [12]:
missingData.to_csv("NewData.csv",index=False)

In [13]:
new = pd.read_csv("NewData.csv")
new

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

Describing

In [14]:
car_sales.dtype

NameError: name 'car_sales' is not defined

In [15]:
car_sales.dtypes

NameError: name 'car_sales' is not defined

In [16]:
carsSales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [17]:
carsSales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [18]:
car_columns = carsSales.columns

In [19]:
car_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [20]:
carsSales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [21]:
carsSales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [22]:
carsSales["Odometer (KM)"].sum()

786014

In [23]:
carsSales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [24]:
value = carsSales["Doors"].sum()

In [25]:
value

40

In [26]:
names = pd.Series(["Janith","Kamal","Sunil","Ruwan"])
names

0    Janith
1     Kamal
2     Sunil
3     Ruwan
dtype: object

In [27]:
names.mean()

TypeError: Could not convert JanithKamalSunilRuwan to numeric

In [ ]:
numbers1 = pd.Series([1,2,3,4,5,6,7,8,9])
numbers1

In [ ]:
numbers1.sum()

In [28]:
sum = numbers1.sum()

NameError: name 'numbers1' is not defined

In [29]:
value = numbers1.count()

NameError: name 'numbers1' is not defined

In [30]:
value

40

In [31]:
sum/value

TypeError: unsupported operand type(s) for /: 'builtin_function_or_method' and 'int'

In [32]:
sum//value

TypeError: unsupported operand type(s) for //: 'builtin_function_or_method' and 'int'

Selecting & Viewing Data

In [33]:
carsSales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [34]:
animals = pd.Series(["Cat","Dog","Panda","Parrot"])

In [35]:
animals

0       Cat
1       Dog
2     Panda
3    Parrot
dtype: object

In [36]:
animals.loc

In [37]:
animals.loc()

In [38]:
animals.loc[3]

'Parrot'

In [39]:
animals.iloc[:2]

0    Cat
1    Dog
dtype: object

In [40]:
animals.loc[:3]

0       Cat
1       Dog
2     Panda
3    Parrot
dtype: object

In [41]:
carsSales.Make

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [42]:
carsSales.make

AttributeError: 'DataFrame' object has no attribute 'make'

In [43]:
carsSales.Colour

0    White
1      Red
2     Blue
3    Black
4    White
5    Green
6     Blue
7     Blue
8    White
9    White
Name: Colour, dtype: object

In [44]:
carsSales[carsSales.Colour == "White"]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
4  Nissan  White         213095      4  $3,500.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [45]:
carsSales[carsSales["Odometer (KM)" ]> 10000]

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [46]:
pd.crosstab(carsSales["Make"],carsSales["Doors"])

Doors   3  4  5
Make
BMW     0  0  1
Honda   0  3  0
Nissan  0  2  0
Toyota  1  3  0

In [47]:
pd.crosstab(carsSales["Make"],carsSales["Doors"])

Doors   3  4  5
Make
BMW     0  0  1
Honda   0  3  0
Nissan  0  2  0
Toyota  1  3  0

In [48]:
carsSales.Make

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object